controllers/AdminController.php

    public function actionIndex()
    {
        $userinfo = Member::find()->select('a.nickname,a.photo,b.name')->alias('a')->innerJoin('{{%member_group}} as b','a.groupid = b.groupid')->asArray()->one();
---
SELECT `a`.`nickname`, `a`.`photo`, `b`.`name` FROM `ly_member` `a` INNER JOIN `ly_member_group` `b` ON a.groupid = b.groupid

    public function actionContent ()
    {
        $id = Yii::$app->request->get('id');
        if($id == 1) {  //用户基本资料
            $info = Member::find()->alias('a')->select('nickname,email,regdate,lastdate,regip,lastip,mobile,b.birthday')->innerJoin('{{%member_detail}} as b','a.userid = b.userid')->asArray()->one();
        }
        if ($id == 2) {
            $info = Member::find()->select('photo,userid')->asArray()->one();
        }
        if ($id == 3) {
            $info = [];
        }
        if ($id == 4) {
            $username = Member::find()->select('`username`')->asArray()->one()['username'];
            $info = News::find()->alias('a')->select('a.`id` , a.`title` , b.`catname` , a.`inputtime` , a.`status`')->innerJoin('{{%category}} as b','a.catid = b.catid')->where("username = '$username'")->asArray()->all();
        }
        if ($id == 5) {
            $group = Member::find()->select('`groupid`,`username`')->asArray()->one();
            $allowpost = Member_group::find()->where("groupid = ".$group['groupid']."")->one();
            if($allowpost['allowpost'] == 0) {
                return '不允许投稿';
            }
            $info['data'] = Category_priv::find()->alias('a')->select('b.`catid`,b.`catname`,b.`parentid`')->innerJoin('{{%category}} as b','a.catid = b.catid')->where("roleid = ".$group['groupid']." and action = 'add'")->orderBy('catid asc')->asArray()->all();
---
SELECT `nickname`, `email`, `regdate`, `lastdate`, `regip`, `lastip`, `mobile`, `b`.`birthday` FROM `ly_member` `a` INNER JOIN `ly_member_detail` `b` ON a.userid = b.userid
SELECT `photo`, `userid` FROM `ly_member`
SELECT `username` FROM `ly_member`
SELECT `a`.`id`, `a`.`title`, `b`.`catname`, `a`.`inputtime`, `a`.`status` FROM `ly_news` `a` INNER JOIN `ly_category` `b` ON a.catid = b.catid WHERE username = 'phpcms'
SELECT `groupid`, `username` FROM `ly_member`
SELECT * FROM `ly_member_group` WHERE groupid = 2
SELECT `b`.`catid`, `b`.`catname`, `b`.`parentid` FROM `ly_category_priv` `a` INNER JOIN `ly_category` `b` ON a.catid = b.catid WHERE roleid = 2 and action = 'add' ORDER BY `catid`