controllers/NewsController.php

SELECT * FROM `ly_category` WHERE ismenu = 1 ORDER BY `catid`
SELECT * FROM `ly_category` WHERE parentid = 18
SELECT * FROM `ly_category` WHERE parentid = 24
---
   public function init()
   {
       parent::init(); // TODO: Change the autogenerated stub
            $nav = Category::find('catname,url,parentid,catid,arrchlidid')->where('ismenu = 1')->orderBy('catid asc')->all();
            $this->nav = $nav;
            $catid = 18;
            $flink = Category::find('catname,url,parentid')->where("parentid = $catid")->all();
           $this->flink = $flink;
           $about = Category::find('catname,url,parentid')->where("parentid = 24")->all();

SELECT * FROM `ly_news` WHERE catid in ( 6,7,8,9,17)
SELECT `b`.* FROM `ly_news` `b` INNER JOIN `ly_position_data` `a` ON a.listorder = b.id WHERE posid = 18
SELECT * FROM `ly_news` WHERE catid = 16 LIMIT 4
---
    public  function actionIndex()
    {
        //导航
        $nav = $this->nav;


        //最新资讯
        $parentid = '';     //查找临沂下的栏目
        for($i=0 ; $i<count($nav) ;$i++) {
            if ($nav[$i]['catid'] == 6) {
                $parentid = $nav[$i]['arrchildid'];
            }
        }
        $news = News::find('title,thumb,description,url,catid')->where("catid in ( $parentid)")->all();

        //banner图
        $posid = 18;
        $banners = News::find('a.data,b.url')->alias('b')->innerJoin('{{%position_data}} as a','a.listorder = b.id')->where("posid = $posid")->all();
        $banner= [];
        foreach($banners as $model){
            $banner[]=$model->attributes;
        }
        //独家新闻
        $catid = 16;
        $selfnews = News::find('title,thumb,description,url')->where("catid = $catid")->offset('0')->limit("4")->all();

SELECT * FROM `ly_news` WHERE catid in ( 10,11,12,13,14 )
---
            }
        }

        $plays = News::find('title,thumb,description,url,catid ')->where("catid in ( $parentid )")->all();

SELECT * FROM `ly_news` WHERE catid = 17
---

        //图集
        $catid = 17;
        $photos = News::find('title,thumb,description,url,catid ')->where("catid = $catid")->all();

SELECT * FROM `ly_news` WHERE  catid in ( 6,7,8,9,17 )
SELECT `b`.* FROM `ly_news` `b` INNER JOIN `ly_position_data` `a` ON a.listorder = b.id WHERE posid = 19
---
    public function actionLinyi(){
        $nav = $this->nav;
        $flink = $this->flink;
       $cat = isset($_GET['cat']) ? $_GET['cat'] : false;
       $page = isset($_GET['p']) ? $_GET['p'] : 1;
        if(!$cat){
            $parentid = '';     //查找临沂下所有的栏目
            for($i=0 ; $i<count($nav) ;$i++) {
                if ($nav[$i]['catid'] == 6) {
                    $parentid = $nav[$i]['arrchildid'];
                }
            }
            $news = News::find('title,thumb,description,url,catid ')->where(" catid in ( $parentid )")->all();

            //查找banner图片
            $posid = 19;

            $banners = News::find('a.data,b.url')->alias('b')->innerJoin('{{%position_data}} as a','a.listorder = b.id')->where("posid = $posid")->all();

SELECT * FROM `ly_news` WHERE catid  = 16 LIMIT 5
---

        }else{
            $news = News::find('title,thumb,description,url,catid ')->where("catid  = $cat");   //所有新闻
            $car = News::find('title,thumb,description,url,catid ')->where("catid  = 16")->offset('0')->limit('5')->all();   //车新闻

SELECT * FROM `ly_news` WHERE catid  = 16 LIMIT 5
---
        }else{
            $news = News::find('title,thumb,description,url,catid ')->where("catid  = $cat");   //所有新闻

            $car = News::find('title,thumb,description,url,catid ')->where("catid  = 16")->offset('0')->limit('5')->all();   //车新闻